Assignement/Lab04-compressibleFlows/combustor2D-RPF-highRe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

deltaT		5e-7;

stopAt          endTime;

endTime         0.2;

adjustTimeStep	yes;

maxCo		5;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#include	"functionObjects/machNumber.cpp"
	#include	"functionObjects/fieldAverage.cpp"
	#include	"functionObjects/pressure.cpp"
	#include	"functionObjects/temperature.cpp"
	#include	"functionObjects/yPlus.cpp"
	#include	"functionObjects/forces.cpp"
}
